// Напишите программу, которая принимает 
//на вход два числа (A и B) и возводит число A в натуральную степень B.


Console.WriteLine("Enter A: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter B: ");
int b = Convert.ToInt32(Console.ReadLine());
int stepen = a;

for (int i = 1; i < b; i++)
    {
    stepen = stepen * a;
    }
Console.WriteLine("A in stepen B: " + stepen);


//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.


int [] array = newArray[8];
{
    for (int i = 0; i < array.Length; i++)
    {
       array[i] = newArray Random(). Next(0,9);
       
    }
}
return array[i];



